In [1]:
# Add Matplotlib inline magic command
%matplotlib inline

In [2]:
# Libraries needed
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import statistics 
import scipy.stats as sts

In [3]:
#Load the city and ride data
city_data_to_load = "/Users/hebamaly/PyBer-Analysis/Resources/city_data.csv"
ride_data_to_load = "/Users/hebamaly/PyBer-Analysis/Resources/ride_data.csv"

In [4]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [5]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [6]:
# Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [7]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [8]:
# Get the unique values of the type of city.
#city_data_df["type"].unique()
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [9]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [10]:
# Get the number of data points from the Suburban cities.
sum(city_data_df["type"]=="Suburban")

36

In [11]:
# Get the number of data points from the Rural cities.
sum(city_data_df["type"]=="Rural")

18

In [12]:
# Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [13]:
# Get the data types of each column.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [14]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [15]:
#Calculate the total fares and driver count by city type
pyber_groupbycitytype=pyber_data_df.groupby('type')
pyber_groupbycitytype_total=pyber_groupbycitytype['fare','driver_count'].sum() 
pyber_groupbycitytype_total

              fare  driver_count
type
Rural      4327.93           537
Suburban  19356.33          8570
Urban     39854.38         59602

In [16]:
#Calculate the total rides by city type
pyber_groupbycitytype_count=pyber_groupbycitytype['ride_id'].count()

In [17]:
# Add the total rides series into the pybergroupcitytype_total dataframe
pyber_groupbycitytype_total['Total Rides'] =  pyber_groupbycitytype_count
pyber_groupbycitytype_total

              fare  driver_count  Total Rides
type
Rural      4327.93           537          125
Suburban  19356.33          8570          625
Urban     39854.38         59602         1625

In [18]:
# Calculate the average fare per ride
Avg_fare_per_ride = pyber_groupbycitytype_total['fare'] / pyber_groupbycitytype_total['Total Rides']
Avg_fare_per_ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [19]:
# Calculate the average driver per ride
Avg_driver_per_ride = pyber_groupbycitytype_total['driver_count'] / pyber_groupbycitytype_total['Total Rides']
Avg_driver_per_ride

type
Rural        4.296000
Suburban    13.712000
Urban       36.678154
dtype: float64

In [20]:
# Calculate the average fare per driver
Avg_fare_per_driver = pyber_groupbycitytype_total['fare'] / pyber_groupbycitytype_total['driver_count']
Avg_fare_per_driver

type
Rural       8.059460
Suburban    2.258615
Urban       0.668675
dtype: float64

In [21]:
# Add Average fare per driver and ride as columns in the summary table
pyber_groupbycitytype_total['Average Fare per Ride'] =  Avg_fare_per_ride
pyber_groupbycitytype_total['Average Fare per Driver'] =  Avg_fare_per_driver
pyber_groupbycitytype_total

,fare,driver_count,Total Rides,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,4327.93,537,125,34.623440,8.059460
Suburban,19356.33,8570,625,30.970128,2.258615
Urban,39854.38,59602,1625,24.525772,0.668675

In [22]:
# Formatting average fare per driver
pyber_groupbycitytype_total['Average Fare per Ride'] = pyber_groupbycitytype_total['Average Fare per Ride'].map("${:,.2f}".format)

In [23]:
# Formatting average fare per driver
pyber_groupbycitytype_total['Average Fare per Driver'] = pyber_groupbycitytype_total['Average Fare per Driver'].map("${:,.2f}".format)

In [24]:
# Fromatting total fare
pyber_groupbycitytype_total['fare'] = pyber_groupbycitytype_total['fare'].map("${:,.2f}".format)

In [25]:
#Rename the summary table column name
pyber_groupbycitytype_total.rename(columns={"driver_count":"Total Drivers", "fare":"Total Fares"})

,Total Fares,Total Drivers,Total Rides,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,"$4,327.93",537,125,$34.62,$8.06
Suburban,"$19,356.33",8570,625,$30.97,$2.26
Urban,"$39,854.38",59602,1625,$24.53,$0.67

In [26]:
# Delete Index name
del pyber_groupbycitytype_total.index.name

In [27]:
# Summary Table by City Type
pyber_groupbycitytype_total

,fare,driver_count,Total Rides,Average Fare per Ride,Average Fare per Driver
Rural,"$4,327.93",537,125,$34.62,$8.06
Suburban,"$19,356.33",8570,625,$30.97,$2.26
Urban,"$39,854.38",59602,1625,$24.53,$0.67